# turtle module  import 
from turtle import* 
# title name
title('Jai Shree Ram')
# background color
bgcolor('black')
# size of pen 
pensize(5)
# pen color 
pencolor("orange")
# draw 49 times "Jai Shree Ram" in the circle
Ram_naam = ["जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम","जय श्री राम","जय श्री राम",
"जय श्री राम","जय श्री राम"]
# To Set 360 angle 
angle = 360/49
penup()
sety(-1)
for i in range(50):
 left(angle)
 forward(260)
 write(Ram_naam[i], align="right",
    font=('Arial',12,"bold"))
 backward(260)

# "ram naam" between the circle name
penup() 
goto(-40,-20)
pendown()
write("|| राम ||", font=("Arial", 60,
"normal"), align="center")
hideturtle()
done()
